/* печать таблицы температур по Фаренгейту
и Цельсию для fahr = 0, 20, ..., 300  */


// формула для вычислений С = (5/9) (Т-32)

// Упражнение 1.3. Усовершенствуйте программу преобразования температур таким образом, чтобы над
//таблицей она печатала заголовок


# include <stdio.h>


int main()
{
    float cels,farh;
    int lower,upper,step;


    step = 20;
    lower = 0;
    upper = 300;

    farh = lower;
    printf("%s\n","Celsius:  Fahrenheit:");
    while (farh <= upper) {

        cels = (5.0 / 9.0) * (farh - 32.0);
        printf("%6.1f\t%3.0f\n", cels, farh);
        farh += step;
        
    }
    return 0;
}


/* 
output :
Celsius:  Fahrenheit:
 -17.8	  0
  -6.7	 20
   4.4	 40
  15.6	 60
  26.7	 80
  37.8	100
  48.9	120
  60.0	140
  71.1	160
  82.2	180
  93.3	200
 104.4	220
 115.6	240
 126.7	260
 137.8	280
 148.9	300
 */