/* Напишите программу, печатающую значение EOF. */


# include <stdio.h>


int main()
{

    printf("%d\n",EOF);
    
}